In [45]:
import pandas as pd 
import numpy as np

In [59]:
f_2015 =pd.read_csv("./data/Fortune_500_2015.csv",usecols=["rank","company"])

In [60]:
f_2016 =pd.read_csv("./data/Fortune_500_2016.csv",usecols=["rank","company"])

In [48]:
companies_2015_2016 = f_2015.merge(f_2016,how='inner',on='company',suffixes=["_2015","_2016"])

In [49]:
companies_2015_2016.head()

   rank_2015             company  rank_2016
0          1             Walmart          1
1          2         Exxon Mobil          2
2          3             Chevron         14
3          4  Berkshire Hathaway          4
4          5               Apple          3

In [50]:
companies_2015_2016[companies_2015_2016["company"] == "Microsoft"]

    rank_2015    company  rank_2016
30         31  Microsoft         25

In [61]:
companies_2015_2016 = f_2015.merge(f_2016,how='outer',on='company',suffixes=["_2015","_2016"],indicator=True)

In [62]:
companies_2015_2016.head()

   rank_2015             company  rank_2016 _merge
0        1.0             Walmart        1.0   both
1        2.0         Exxon Mobil        2.0   both
2        3.0             Chevron       14.0   both
3        4.0  Berkshire Hathaway        4.0   both
4        5.0               Apple        3.0   both

In [69]:
only_2015 = companies_2015_2016[companies_2015_2016["_merge"] == "left only"]